In [1]:
import pandas as pd

In [2]:
dados = [[1,2,3], [4,5,6], [7,8,9]]

In [22]:
df = pd.DataFrame(dados,index = ['3','2','1'], columns = ['Z','Y','X'])

In [23]:
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

In [24]:
df.sort_index(inplace = True)

In [25]:
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

In [26]:
df.sort_index(inplace = True, axis = 1)

In [27]:
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

In [31]:
df.sort_values(by = 'X', inplace = True)
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

In [32]:
df.sort_values(by = '3', axis =1, inplace = True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9